tutorials/DLpisoFoam/with_tucker/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    geometry_z_top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    geometry_z_bot
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    geometry_y_bot
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    geometry_inlet
    {
        type            zeroGradient;
    }
    geometry_y_top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    geometry_outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    geometry_obstacle
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
